tap "buo/cask-upgrade"
brew "act"
brew "libpng"
brew "xz"
brew "zstd"
brew "jpeg-xl"
brew "ca-certificates"
brew "libyaml"
brew "python@3.13"
brew "azure-cli"
brew "black"
brew "boost"
brew "glib"
brew "capstone"
brew "certifi"
brew "clang-format"
brew "cmake"
brew "node"
brew "commitlint"
brew "coreutils"
brew "doxygen"
brew "ffmpeg"
brew "gcc"
brew "gh"
brew "icu4c@77"
brew "ghostscript"
brew "git"
brew "git-crypt"
brew "git-lfs"
brew "gnupg"
brew "gpac"
brew "gperftools"
brew "pkgconf"
brew "hdf5"
brew "iperf"
brew "iperf3"
brew "jq"
brew "libunwind-headers"
brew "python@3.12"
brew "lit"
brew "mas"
brew "mkvtoolnix"
brew "ninja"
brew "protobuf"
brew "openai-whisper"
brew "openjdk"
brew "pandoc"
brew "pdm"
brew "pinentry-mac"
brew "pre-commit"
brew "pyinstaller"
brew "pylint"
brew "python-matplotlib"
brew "python-setuptools"
brew "python-tk@3.12"
brew "ruby"
brew "scons"
brew "telnet"
brew "tmux"
brew "trash"
brew "virtualenv"
brew "wget"
brew "wireshark"
cask "balenaetcher"
cask "codex"
cask "docker-desktop"
cask "handbrake-app"
cask "launchcontrol"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "raspberry-pi-imager"
cask "steam"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
mas "AdBlock", id: 1402042596
mas "Amphetamine", id: 937984704
mas "Cake Wallet", id: 1334702542
mas "DaisyDisk", id: 411643860
mas "Developer", id: 640199958
mas "Discovery", id: 1381004916
mas "Drive Capacity Tester", id: 1645711424
mas "Folder Quick Look", id: 6753110395
mas "Go Map!!", id: 592990211
mas "IOBrowser", id: 6444616879
mas "Keynote", id: 409183694
mas "Magic Disk Benchmark", id: 1608793370
mas "Mapper", id: 1589391989
mas "Meshtastic", id: 1586432531
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft To Do", id: 1274495053
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Speedtest", id: 1153157709
mas "Wayback Machine", id: 1472432422
mas "WhatsApp", id: 310633997
vscode "bierner.github-markdown-preview"
vscode "codezombiech.gitignore"
vscode "davidanson.vscode-markdownlint"
vscode "dotjoshjohnson.xml"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "hashicorp.hcl"
vscode "hediet.vscode-drawio"
vscode "marp-team.marp-vscode"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-azuretools.vscode-documentdb"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.vscode-copilot-vision"
vscode "ms-vscode.vscode-websearchforcopilot"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-windows-ai-studio.windows-ai-studio"
vscode "openai.chatgpt"
vscode "redhat.vscode-yaml"
vscode "sanjulaganepola.github-local-actions"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "teamsdevapp.vscode-ai-foundry"
vscode "tomoki1207.pdf"
vscode "tsinghua-hexin-joint-institute.gem5-slicc"
vscode "waderyan.gitblame"
vscode "yzane.markdown-pdf"
