tap "homebrew/bundle"
tap "homebrew/services"
tap "mas-cli/tap"
brew "libpng"
brew "zstd"
brew "boost"
brew "python@3.12"
brew "capstone"
brew "cmake"
brew "commitlint"
brew "coreutils"
brew "doxygen"
brew "ffmpeg"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-lfs"
brew "gpac"
brew "gpg"
brew "pkg-config"
brew "hdf5"
brew "jq"
brew "lit"
brew "llvm"
brew "mas"
brew "mkvtoolnix"
brew "pandoc"
brew "pre-commit"
brew "pyyaml"
brew "scons"
brew "torsocks"
brew "wget"
cask "basictex"
mas "AdBlock", id: 1402042596
mas "Amphetamine", id: 937984704
mas "DaisyDisk", id: 411643860
mas "Developer", id: 640199958
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft To Do", id: 1274495053
mas "Microsoft Word", id: 462054704
mas "Numbers", id: 409203825
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "PCalc", id: 403504866
mas "Playgrounds", id: 1496833156
mas "Prime Video", id: 545519333
mas "Speedtest", id: 1153157709
mas "Steam Link", id: 1246969117
mas "WhatsApp", id: 1147396723
mas "Xcode", id: 497799835
mas "‎WhatsApp", id: 310633997
vscode "bbenoist.vagrant"
vscode "bierner.github-markdown-preview"
vscode "davidanson.vscode-markdownlint"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-pull-request-github"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "tamasfe.even-better-toml"
vscode "tomoki1207.pdf"
vscode "tsinghua-hexin-joint-institute.gem5-slicc"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "yzane.markdown-pdf"
